artillery2.yml
config:
  target: https://www.saucedemo.com/
  engines:
    playwright:
      extendedMetrics: true    
      launchOptions:
        headless: true
  processor: "./tests/artillery/login.js"
  phases:
    # injects 1 user every 2 second 20 seconds
    - name: RampUp
      duration: 20
      arrivalRate: 2
      rampTo: 1
scenarios:
  - engine: playwright
    testFunction: "artilleryScript"